src/project02/app/controllers/store_controller.rb

	def save_order
		@cart = find_cart
		@order = Order.new(params[:order])
		@order.add_line_items_from_cart(@cart)
		if @order.save
---
INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2011-02-02 05:46:57', 3, 2, 1, 55.5, '2011-02-02 05:46:57')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('asdf', 'asf', '2011-02-02 05:46:57', '2011-02-02 05:46:57', 'check', 'sdfa')